In [4]:
import re
import os
import glob
import pandas as pd

In [5]:
# Specify the folder path and the regex pattern for file names
folder_path = './data'
file_pattern = '*.csv'  # Adjust the pattern as needed

# Use glob to get a list of file paths that match the pattern
file_paths = glob.glob(f'{folder_path}/{file_pattern}')

# Create an empty list to store DataFrames
dataframes = []

# Loop through the file paths and read each CSV file into a DataFrame
for file_path in file_paths:
    # Extract the file name using regex
    file_name = re.search(r'([^\/]+)\.csv', file_path).group(1)
    
    # Read the CSV file into a DataFrame
    df = pd.read_csv(file_path)
    
    # Add a column with the file name to identify the source
    # df['source_file'] = file_name
    
    # Append the DataFrame to the list
    dataframes.append(df)

In [6]:
# List the files in the order which there were read in with pandas for correct unpacking
os.listdir("./data")

['customer.csv',
 'car.csv',
 'service_request.csv',
 'closed_request.csv',
 'owns.csv',
 'mechanic.csv']

In [7]:
customer_df, car_df, service_df, closed_request_df, owns_df, mechanic_df = dataframes

In [12]:
customer_df.columns = ["id", "first_name", "last_name", "phone_number", "address"]
customer_df.head()

   id first_name last_name   phone_number                            address
0   1    Alberto  Scarlett  (337)926-8804  8120 Bald Hill Street Baton Rouge
1   2      Wyatt     Ruoff  (516)560-5642    9169 Campfire Ave. Cockeysville
2   3    Alfonso   Denmark  (515)325-7213         88 Young Avenue Oak Forest
3   4      Pearl   Straube  (637)979-1751  724 East Warren St. New Brunswick
4   5    Vincent  Wohlwend  (347)285-2855              797 Spruce Dr. Lanham

In [14]:
car_df.columns = ["vin", "make", "model", "year"]
car_df.head()

                vin         make   model  year
0  IORSVN4427624382  Lamborghini      M1  2005
1  OPBSAH6612868960         Ford   Sunny  2015
2  SPIKGI5665802983      Vauxhal  Passat  2006
3  ZTBPOX7141614869      Citroen      C3  2011
4  TWMSHZ5260896382      Bristol      DB  2012

In [16]:
service_df.columns = ["request_id", "customer_id", "car_vin", "date", "odometer", "complain"]
service_df.head()

,request_id,customer_id,car_vin,date,odometer,complain
0,1,87,ZAIWSE9730973323,10/17/2016 00:00,62288,The wheel does not turn right
1,2,21,RJBMKY7364717712,2/12/2016 00:00,137398,Burns too much gas
2,3,234,PJILTP5532102960,1/1/2016 00:00,107264,The wheel does not turn right
3,4,499,IGSCTT8349812312,7/9/2016 00:00,145437,No brakes
4,5,99,ELBWIE1987678371,8/17/2016 00:00,181150,Change oil

In [17]:
closed_request_df.head()

   1  1.1  230 10/22/2016 00:00      We lost your car   96
0  2    2  215  2/18/2016 00:00  We changed the color  592
1  3    3   34   1/5/2016 00:00     This is a bicycle   77
2  4    4  204  7/10/2016 00:00     This is a bicycle  976
3  5    5   11  8/22/2016 00:00           Changed Oil  481
4  6    6  104  1/14/2016 00:00         Breaks are ok  278

In [18]:
closed_request_df.columns = ["", "request_id", "", "date", "comment", "bill"]
closed_request_df.head()

      request_id                  date               comment  bill
0  2           2  215  2/18/2016 00:00  We changed the color   592
1  3           3   34   1/5/2016 00:00     This is a bicycle    77
2  4           4  204  7/10/2016 00:00     This is a bicycle   976
3  5           5   11  8/22/2016 00:00           Changed Oil   481
4  6           6  104  1/14/2016 00:00         Breaks are ok   278